==========================================================================================
Layer (type:depth-idx)                   Output Shape              Param #
==========================================================================================
ResNet                                   [64, 1]                   --
+ Conv2d: 1-1                            [64, 64, 112, 112]        9,408
+ BatchNorm2d: 1-2                       [64, 64, 112, 112]        128
+ ReLU: 1-3                              [64, 64, 112, 112]        --
+ MaxPool2d: 1-4                         [64, 64, 56, 56]          --
+ Sequential: 1-5                        [64, 64, 56, 56]          --
|    + BasicBlock: 2-1                   [64, 64, 56, 56]          --
|    |    + Conv2d: 3-1                  [64, 64, 56, 56]          36,864
|    |    + BatchNorm2d: 3-2             [64, 64, 56, 56]          128
|    |    + ReLU: 3-3                    [64, 64, 56, 56]          --
|    |    + Conv2d: 3-4                  [64, 64, 56, 56]          36,864
|    |    + BatchNorm2d: 3-5             [64, 64, 56, 56]          128
|    |    + ReLU: 3-6                    [64, 64, 56, 56]          --
|    + BasicBlock: 2-2                   [64, 64, 56, 56]          --
|    |    + Conv2d: 3-7                  [64, 64, 56, 56]          36,864
|    |    + BatchNorm2d: 3-8             [64, 64, 56, 56]          128
|    |    + ReLU: 3-9                    [64, 64, 56, 56]          --
|    |    + Conv2d: 3-10                 [64, 64, 56, 56]          36,864
|    |    + BatchNorm2d: 3-11            [64, 64, 56, 56]          128
|    |    + ReLU: 3-12                   [64, 64, 56, 56]          --
+ Sequential: 1-6                        [64, 128, 28, 28]         --
|    + BasicBlock: 2-3                   [64, 128, 28, 28]         --
|    |    + Conv2d: 3-13                 [64, 128, 28, 28]         73,728
|    |    + BatchNorm2d: 3-14            [64, 128, 28, 28]         256
|    |    + ReLU: 3-15                   [64, 128, 28, 28]         --
|    |    + Conv2d: 3-16                 [64, 128, 28, 28]         147,456
|    |    + BatchNorm2d: 3-17            [64, 128, 28, 28]         256
|    |    + Sequential: 3-18             [64, 128, 28, 28]         8,448
|    |    + ReLU: 3-19                   [64, 128, 28, 28]         --
|    + BasicBlock: 2-4                   [64, 128, 28, 28]         --
|    |    + Conv2d: 3-20                 [64, 128, 28, 28]         147,456
|    |    + BatchNorm2d: 3-21            [64, 128, 28, 28]         256
|    |    + ReLU: 3-22                   [64, 128, 28, 28]         --
|    |    + Conv2d: 3-23                 [64, 128, 28, 28]         147,456
|    |    + BatchNorm2d: 3-24            [64, 128, 28, 28]         256
|    |    + ReLU: 3-25                   [64, 128, 28, 28]         --
+ Sequential: 1-7                        [64, 256, 14, 14]         --
|    + BasicBlock: 2-5                   [64, 256, 14, 14]         --
|    |    + Conv2d: 3-26                 [64, 256, 14, 14]         294,912
|    |    + BatchNorm2d: 3-27            [64, 256, 14, 14]         512
|    |    + ReLU: 3-28                   [64, 256, 14, 14]         --
|    |    + Conv2d: 3-29                 [64, 256, 14, 14]         589,824
|    |    + BatchNorm2d: 3-30            [64, 256, 14, 14]         512
|    |    + Sequential: 3-31             [64, 256, 14, 14]         33,280
|    |    + ReLU: 3-32                   [64, 256, 14, 14]         --
|    + BasicBlock: 2-6                   [64, 256, 14, 14]         --
|    |    + Conv2d: 3-33                 [64, 256, 14, 14]         589,824
|    |    + BatchNorm2d: 3-34            [64, 256, 14, 14]         512
|    |    + ReLU: 3-35                   [64, 256, 14, 14]         --
|    |    + Conv2d: 3-36                 [64, 256, 14, 14]         589,824
|    |    + BatchNorm2d: 3-37            [64, 256, 14, 14]         512
|    |    + ReLU: 3-38                   [64, 256, 14, 14]         --
+ Sequential: 1-8                        [64, 512, 7, 7]           --
|    + BasicBlock: 2-7                   [64, 512, 7, 7]           --
|    |    + Conv2d: 3-39                 [64, 512, 7, 7]           1,179,648
|    |    + BatchNorm2d: 3-40            [64, 512, 7, 7]           1,024
|    |    + ReLU: 3-41                   [64, 512, 7, 7]           --
|    |    + Conv2d: 3-42                 [64, 512, 7, 7]           2,359,296
|    |    + BatchNorm2d: 3-43            [64, 512, 7, 7]           1,024
|    |    + Sequential: 3-44             [64, 512, 7, 7]           132,096
|    |    + ReLU: 3-45                   [64, 512, 7, 7]           --
|    + BasicBlock: 2-8                   [64, 512, 7, 7]           --
|    |    + Conv2d: 3-46                 [64, 512, 7, 7]           2,359,296
|    |    + BatchNorm2d: 3-47            [64, 512, 7, 7]           1,024
|    |    + ReLU: 3-48                   [64, 512, 7, 7]           --
|    |    + Conv2d: 3-49                 [64, 512, 7, 7]           2,359,296
|    |    + BatchNorm2d: 3-50            [64, 512, 7, 7]           1,024
|    |    + ReLU: 3-51                   [64, 512, 7, 7]           --
+ AdaptiveAvgPool2d: 1-9                 [64, 512, 1, 1]           --
+ Sequential: 1-10                       [64, 1]                   --
|    + Linear: 2-9                       [64, 1]                   513
==========================================================================================
Total params: 11,177,025
Trainable params: 11,177,025
Non-trainable params: 0
Total mult-adds (Units.GIGABYTES): 116.07
==========================================================================================
Input size (MB): 38.54
Forward/backward pass size (MB): 2543.32
Params size (MB): 44.71
Estimated Total Size (MB): 2626.56
==========================================================================================